Ran Plan for project: `eks/eksd_apnortheast2/eksdapne2-eusc` dir: `terraform/eks/eksd_apnortheast2/eksdapne2-eusc` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.eks.helm_release.karpenter[0] will be created
+ resource "helm_release" "karpenter" {
      + atomic                     = false
      + chart                      = "karpenter"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "karpenter"
      + namespace                  = "karpenter"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://public.ecr.aws/karpenter"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v0.32.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = "arn:aws:iam::533267446521:role/eks-eksdapne2-eusc-karpenter-controller"
        }
      + set {
          + name  = "settings.clusterEndpoint"
          + value = "https://9D8878015FBF94D6BAB6C46137B33B11.gr7.ap-northeast-2.eks.amazonaws.com"
        }
      + set {
          + name  = "settings.clusterName"
          + value = "eksdapne2-eusc"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p eks/eksd_apnortheast2/eksdapne2-eusc`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.overtake.live/lock?id=alpha3002025%252Feks-tf-provisioning%252Fterraform%252Feks%252Feksd_apnortheast2%252Feksdapne2-eusc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p eks/eksd_apnortheast2/eksdapne2-eusc`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
